Merge pull request #97 from oddessentials/feat/cleanup
Feat/cleanup
